//1+++++++++++++++++++++===

// let userNum = prompt("Введите свое число", "");

// if (userNum > 0) {
//     alert("Положительное")
// } else {
//     alert("Отрицательное");
// }





//2++++++++++++++++++++++++++++

// let userString = "Hello world!";

// console.log(userString.length);





//3---------------------------------




//4+++++++++++++++++++++++++++++++++++

// let userNum = prompt("Введите свое число", "");

// if (userNum % 2 === 0) {
//     alert("Положительное")
// } else {
//     alert("Отрицательное")
// }